tutorials/immersedBoundary/cylBumpInterIbFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.01;
    }

    pd
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.01;
    }

    pdFinal
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          0;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          0;
        maxIter          100;
        tolerance        1e-08;
        relTol           0;
    }

    alpha1
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          0;
        maxIter          100;
        tolerance        1e-08;
        relTol           0;
    }
}

PISO
{
    cAlpha          1;
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     6;
    nNonOrthogonalCorrectors 0;

    pdRefPoint      (-0.9 1.4 0.05);
    pdRefValue      0;

    pRefPoint      (-0.9 1.4 0.05);
    pRefValue      0;

    limitMagU      35;
}

relaxationFactors
{
    U          0.9;
    pd         0.8;
}

// ************************************************************************* //
